InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/GPIO/Header/Peripheral/Register/RegisterDefines/GPIO_RegisterDefines_DMACTL.h
/**
 *
 * @file GPIO_RegisterDefines_DMACTL.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 25 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 25 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_GPIO_GPIO_PERIPHERAL_GPIO_REGISTER_GPIO_REGISTERDEFINES_GPIO_REGISTERDEFINES_DMACTL_H_
#define XDRIVER_MCU_DRIVER_HEADER_GPIO_GPIO_PERIPHERAL_GPIO_REGISTER_GPIO_REGISTERDEFINES_GPIO_REGISTERDEFINES_DMACTL_H_

#include <stdint.h>

/******************************************************************************************
************************************ 24 GPIODMACTL *********************************************
******************************************************************************************/
/*----------*/
#define GPIO_GPIODMACTL_R_DMAEN_MASK             ((uint32_t)0x000000FFu)
#define GPIO_GPIODMACTL_R_DMAEN_BIT              (0u)
#define GPIO_GPIODMACTL_R_DMAEN_DIS              ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_R_DMAEN_EN               ((uint32_t)0x000000FFu)

#define GPIO_GPIODMACTL_DMAEN_MASK               ((uint32_t)0x000000FFu)
#define GPIO_GPIODMACTL_DMAEN_DIS                ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_DMAEN_EN                 ((uint32_t)0x000000FFu)
/*----------*/

/*----------*/
#define GPIO_GPIODMACTL_R_DMAEN0_MASK            ((uint32_t)0x00000001u)
#define GPIO_GPIODMACTL_R_DMAEN0_BIT             (0u)
#define GPIO_GPIODMACTL_R_DMAEN0_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_R_DMAEN0_EN              ((uint32_t)0x00000001u)

#define GPIO_GPIODMACTL_DMAEN0_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODMACTL_DMAEN0_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_DMAEN0_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODMACTL_R_DMAEN1_MASK            ((uint32_t)0x00000002u)
#define GPIO_GPIODMACTL_R_DMAEN1_BIT             (1u)
#define GPIO_GPIODMACTL_R_DMAEN1_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_R_DMAEN1_EN              ((uint32_t)0x00000002u)

#define GPIO_GPIODMACTL_DMAEN1_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODMACTL_DMAEN1_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_DMAEN1_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODMACTL_R_DMAEN2_MASK            ((uint32_t)0x00000004u)
#define GPIO_GPIODMACTL_R_DMAEN2_BIT             (2u)
#define GPIO_GPIODMACTL_R_DMAEN2_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_R_DMAEN2_EN              ((uint32_t)0x00000004u)

#define GPIO_GPIODMACTL_DMAEN2_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODMACTL_DMAEN2_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_DMAEN2_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODMACTL_R_DMAEN3_MASK            ((uint32_t)0x00000008u)
#define GPIO_GPIODMACTL_R_DMAEN3_BIT             (3u)
#define GPIO_GPIODMACTL_R_DMAEN3_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_R_DMAEN3_EN              ((uint32_t)0x00000008u)

#define GPIO_GPIODMACTL_DMAEN3_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODMACTL_DMAEN3_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_DMAEN3_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODMACTL_R_DMAEN4_MASK            ((uint32_t)0x00000010u)
#define GPIO_GPIODMACTL_R_DMAEN4_BIT             (4u)
#define GPIO_GPIODMACTL_R_DMAEN4_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_R_DMAEN4_EN              ((uint32_t)0x00000010u)

#define GPIO_GPIODMACTL_DMAEN4_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODMACTL_DMAEN4_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_DMAEN4_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODMACTL_R_DMAEN5_MASK            ((uint32_t)0x00000020u)
#define GPIO_GPIODMACTL_R_DMAEN5_BIT             (5u)
#define GPIO_GPIODMACTL_R_DMAEN5_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_R_DMAEN5_EN              ((uint32_t)0x00000020u)

#define GPIO_GPIODMACTL_DMAEN5_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODMACTL_DMAEN5_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_DMAEN5_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODMACTL_R_DMAEN6_MASK            ((uint32_t)0x00000040u)
#define GPIO_GPIODMACTL_R_DMAEN6_BIT             (6u)
#define GPIO_GPIODMACTL_R_DMAEN6_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_R_DMAEN6_EN              ((uint32_t)0x00000040u)

#define GPIO_GPIODMACTL_DMAEN6_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODMACTL_DMAEN6_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_DMAEN6_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/

#define GPIO_GPIODMACTL_R_DMAEN7_MASK            ((uint32_t)0x00000080u)
#define GPIO_GPIODMACTL_R_DMAEN7_BIT             (7u)
#define GPIO_GPIODMACTL_R_DMAEN7_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_R_DMAEN7_EN              ((uint32_t)0x00000080u)

#define GPIO_GPIODMACTL_DMAEN7_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODMACTL_DMAEN7_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODMACTL_DMAEN7_EN                ((uint32_t)0x00000001u)
/*----------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_GPIO_GPIO_PERIPHERAL_GPIO_REGISTER_GPIO_REGISTERDEFINES_GPIO_REGISTERDEFINES_DMACTL_H_ */
